[
  {
    "id": 1,
    "name": "Premium Black Hoodie",
    "brand": "Clothique",
    "category": "Hoodies",
    "price": 2499,
    "discount": 10,
    "rating": 4.7,
    "reviews": 134,
    "stock": 45,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Black", "Grey"],
    "material": "80% Cotton, 20% Polyester",
    "care": "Machine wash cold, do not bleach, tumble dry low",
    "image": "/products/hoodie-black.jpg",
    "description": "The Premium Black Hoodie from Clothique is designed for those who value comfort, durability, and modern street style. Crafted with a high-quality cotton-polyester blend, this hoodie offers a soft interior feel while maintaining a strong outer structure that resists wear and tear. The fabric is breathable yet warm, making it ideal for both chilly evenings and mild winter days.\n\nThe relaxed fit ensures all-day comfort whether you're heading to class, hanging out with friends, or running daily errands. Ribbed cuffs and hem provide a snug fit, while the adjustable drawstring hood adds both function and style. The front kangaroo pocket offers convenient storage for your phone, wallet, or hands.\n\nThis hoodie pairs effortlessly with jeans, joggers, or cargo pants, making it a versatile addition to your wardrobe. The deep black shade maintains its richness even after multiple washes, ensuring long-lasting style. Perfect for casual wear, travel, or light outdoor activities, this hoodie represents the perfect balance between fashion and practicality."
  },
  {
    "id": 2,
    "name": "Classic White T-Shirt",
    "brand": "Clothique",
    "category": "T-Shirts",
    "price": 999,
    "discount": 5,
    "rating": 4.5,
    "reviews": 210,
    "stock": 120,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["White"],
    "material": "100% Organic Cotton",
    "care": "Machine wash cold, iron on low heat",
    "image": "/products/tshirt-white.jpg",
    "description": "The Classic White T-Shirt by Clothique is a timeless essential designed for everyday comfort and effortless style. Made from 100% organic cotton, this t-shirt feels soft against the skin while remaining breathable throughout the day. Its lightweight fabric makes it perfect for warm weather, layering in winter, or casual daily wear.\n\nThe tailored yet relaxed fit provides a clean silhouette without feeling restrictive. Reinforced stitching around the neckline and sleeves ensures durability, even after repeated washes. The crisp white color adds versatility, allowing you to pair it with jeans, chinos, shorts, or under a jacket for a smart-casual look.\n\nWhether you're heading to work, going out with friends, or relaxing at home, this t-shirt adapts to every lifestyle. The natural cotton fibers help regulate body temperature and reduce irritation, making it ideal for long wear. Simple, stylish, and sustainable, this white t-shirt is a wardrobe staple for anyone who values quality and comfort."
  },
  {
    "id": 3,
    "name": "Slim Fit Blue Jeans",
    "brand": "Clothique",
    "category": "Jeans",
    "price": 2999,
    "discount": 15,
    "rating": 4.6,
    "reviews": 98,
    "stock": 60,
    "sizes": ["30", "32", "34", "36"],
    "colors": ["Blue"],
    "material": "98% Denim, 2% Elastane",
    "care": "Wash inside out, cold wash only",
    "image": "/products/jeans-blue.jpg",
    "description": "Clothique’s Slim Fit Blue Jeans are designed for modern comfort with a classic denim look. The premium denim fabric is blended with elastane to provide stretch and flexibility, ensuring ease of movement throughout the day. These jeans contour naturally to your body while maintaining their shape over time.\n\nThe mid-rise waist and slim-leg cut create a clean, stylish appearance suitable for both casual and semi-formal occasions. Deep pockets and durable stitching enhance functionality and longevity. The rich blue wash adds depth and character, making them easy to match with t-shirts, shirts, or hoodies.\n\nPerfect for daily wear, office-casual outfits, or weekend outings, these jeans offer comfort without compromising on style. The breathable fabric prevents overheating, while the stretch ensures all-day flexibility. If you're looking for reliable, stylish denim, this pair is an excellent choice."
  },

  {
    "id": 4,
    "name": "Oversized Graphic T-Shirt",
    "brand": "Clothique",
    "category": "T-Shirts",
    "price": 1299,
    "discount": 8,
    "rating": 4.8,
    "reviews": 156,
    "stock": 75,
    "sizes": ["M", "L", "XL"],
    "colors": ["Black", "Beige"],
    "material": "100% Cotton",
    "care": "Cold wash, do not iron on print",
    "image": "/products/graphic-tee.jpg",
    "description": "The Oversized Graphic T-Shirt is a bold fashion statement for those who love streetwear aesthetics. Made from premium cotton, it offers a soft, breathable feel that stays comfortable all day. The oversized fit provides a relaxed look while allowing easy movement.\n\nThe unique front graphic is printed using high-quality ink that resists fading and cracking. The fabric retains its shape after multiple washes, making it a reliable long-term addition to your wardrobe. The loose fit pairs perfectly with cargo pants, jeans, or shorts for a trendy urban look.\n\nIdeal for casual outings, concerts, or daily wear, this t-shirt combines comfort with bold design. It’s a must-have for anyone who enjoys expressive, modern fashion."
  },

  {
    "id": 5,
    "name": "Beige Casual Jacket",
    "brand": "Clothique",
    "category": "Jackets",
    "price": 4999,
    "discount": 12,
    "rating": 4.6,
    "reviews": 74,
    "stock": 30,
    "sizes": ["M", "L", "XL"],
    "colors": ["Beige"],
    "material": "Polyester Blend",
    "care": "Dry clean only",
    "image": "/products/jacket-beige.jpg",
    "description": "The Beige Casual Jacket by Clothique blends elegance with everyday functionality. Crafted from a durable polyester blend, it provides warmth without feeling bulky. The structured design offers a sharp silhouette, while the soft inner lining ensures comfort during extended wear.\n\nIts neutral beige color complements a wide range of outfits, from jeans and t-shirts to chinos and button-down shirts. The front zipper and deep pockets add both style and practicality.\n\nThis jacket is perfect for cool evenings, casual events, or light travel. Stylish, versatile, and comfortable, it enhances your wardrobe effortlessly."
  },
  {
    "id": 6,
    "name": "Brown Cargo Pants",
    "brand": "Clothique",
    "category": "Pants",
    "price": 2799,
    "discount": 10,
    "rating": 4.5,
    "reviews": 89,
    "stock": 50,
    "sizes": ["30", "32", "34", "36"],
    "colors": ["Brown"],
    "material": "Cotton Twill",
    "care": "Cold wash, do not bleach",
    "image": "/products/cargo-brown.jpg",
    "description": "The Brown Cargo Pants from Clothique are designed for both style and practicality. Made from durable cotton twill, these pants provide excellent comfort while maintaining a rugged look. The breathable fabric ensures all-day ease, making them ideal for long wear.\n\nFeaturing multiple utility pockets, these cargo pants offer convenient storage for your daily essentials like phone, wallet, or keys. The relaxed fit allows easy movement, while the structured design keeps your look sharp.\n\nPerfect for casual outings, travel, or daily wear, these pants pair well with t-shirts, hoodies, or jackets. The earthy brown tone adds versatility to your wardrobe, giving you a reliable and fashionable option for everyday style."
  },
  {
    "id": 7,
    "name": "Denim Jacket",
    "brand": "Clothique",
    "category": "Jackets",
    "price": 4599,
    "discount": 15,
    "rating": 4.7,
    "reviews": 120,
    "stock": 35,
    "sizes": ["M", "L", "XL"],
    "colors": ["Blue"],
    "material": "100% Denim",
    "care": "Wash inside out, air dry",
    "image": "/products/denim-jacket.jpg",
    "description": "The Classic Denim Jacket by Clothique is a timeless piece that never goes out of style. Crafted from high-quality denim, it offers durability and comfort with a structured fit. The breathable fabric makes it suitable for year-round wear.\n\nWith reinforced stitching and sturdy metal buttons, this jacket is built to last. The chest and side pockets add both functionality and aesthetic appeal.\n\nPair it with jeans, chinos, or even over a hoodie for a layered look. Whether you're heading out for a casual day or a night with friends, this denim jacket adds effortless style to your outfit."
  },
  {
    "id": 8,
    "name": "Grey Sweatpants",
    "brand": "Clothique",
    "category": "Pants",
    "price": 1999,
    "discount": 8,
    "rating": 4.6,
    "reviews": 143,
    "stock": 80,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Grey"],
    "material": "Cotton Blend",
    "care": "Machine wash cold",
    "image": "/products/sweatpants-grey.jpg",
    "description": "These Grey Sweatpants are designed for ultimate comfort and everyday wear. Made with a soft cotton blend, they provide warmth without feeling heavy. The elastic waistband ensures a snug yet flexible fit.\n\nPerfect for workouts, lounging, or casual outings, these sweatpants offer both style and comfort. The minimalist design allows easy pairing with hoodies or t-shirts.\n\nDurable stitching and fade-resistant fabric ensure long-lasting quality, making them a reliable addition to your wardrobe."
  },
  {
    "id": 9,
    "name": "Black Leather Jacket",
    "brand": "Clothique",
    "category": "Jackets",
    "price": 8999,
    "discount": 20,
    "rating": 4.8,
    "reviews": 65,
    "stock": 20,
    "sizes": ["M", "L", "XL"],
    "colors": ["Black"],
    "material": "Faux Leather",
    "care": "Wipe clean only",
    "image": "/products/leather-jacket.jpg",
    "description": "The Black Leather Jacket by Clothique brings a bold and confident look to your wardrobe. Crafted from premium faux leather, it offers a sleek appearance with a soft inner lining for comfort.\n\nThe tailored fit enhances your silhouette while maintaining flexibility. Zipper pockets provide secure storage and add to the jacket’s edgy design.\n\nIdeal for night outings, bike rides, or stylish casual wear, this jacket is a statement piece that never goes unnoticed."
  },
  {
    "id": 10,
    "name": "Striped Casual Shirt",
    "brand": "Clothique",
    "category": "Shirts",
    "price": 2299,
    "discount": 12,
    "rating": 4.4,
    "reviews": 77,
    "stock": 55,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["White", "Blue"],
    "material": "Cotton",
    "care": "Machine wash cold",
    "image": "/products/striped-shirt.jpg",
    "description": "The Striped Casual Shirt is perfect for smart-casual occasions. Made from breathable cotton, it keeps you comfortable throughout the day. The slim fit design offers a clean and modern look.\n\nThe subtle stripe pattern adds style without being overwhelming. Pair it with jeans or chinos for a polished outfit.\n\nGreat for office wear, meetups, or casual events, this shirt balances comfort and elegance effortlessly."
  },
  {
    "id": 11,
    "name": "Olive Green Hoodie",
    "brand": "Clothique",
    "category": "Hoodies",
    "price": 2599,
    "discount": 10,
    "rating": 4.6,
    "reviews": 92,
    "stock": 48,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Olive"],
    "material": "Cotton Polyester Blend",
    "care": "Cold wash, tumble dry low",
    "image": "/products/hoodie-olive.jpg",
    "description": "The Olive Green Hoodie offers comfort and modern style. Made from a soft cotton-polyester blend, it provides warmth while remaining breathable.\n\nThe relaxed fit and adjustable hood make it perfect for casual wear. The olive shade adds a trendy touch to your outfit.\n\nIdeal for daily wear, workouts, or travel, this hoodie is both functional and fashionable."
  },
  {
    "id": 12,
    "name": "Formal Black Blazer",
    "brand": "Clothique",
    "category": "Blazers",
    "price": 6999,
    "discount": 18,
    "rating": 4.7,
    "reviews": 58,
    "stock": 25,
    "sizes": ["M", "L", "XL"],
    "colors": ["Black"],
    "material": "Wool Blend",
    "care": "Dry clean only",
    "image": "/products/black-blazer.jpg",
    "description": "The Formal Black Blazer is designed for elegance and professionalism. Made from a premium wool blend, it offers a refined fit and lasting comfort.\n\nIts sharp cut and classic design make it suitable for business meetings, formal events, or evening wear.\n\nPair it with dress pants or chinos for a polished look that stands out."
  },
  {
    "id": 13,
    "name": "Blue Checked Shirt",
    "brand": "Clothique",
    "category": "Shirts",
    "price": 2199,
    "discount": 10,
    "rating": 4.5,
    "reviews": 69,
    "stock": 60,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Blue"],
    "material": "Cotton",
    "care": "Machine wash cold",
    "image": "/products/checked-shirt.jpg",
    "description": "This Blue Checked Shirt offers a classic yet modern look. The soft cotton fabric ensures comfort throughout the day.\n\nThe check pattern adds character, making it suitable for both casual and semi-formal wear.\n\nA versatile piece that pairs well with jeans or trousers."
  },
  {
    "id": 14,
    "name": "Navy Blue Shorts",
    "brand": "Clothique",
    "category": "Shorts",
    "price": 1599,
    "discount": 5,
    "rating": 4.4,
    "reviews": 81,
    "stock": 90,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Navy"],
    "material": "Cotton Blend",
    "care": "Machine wash cold",
    "image": "/products/navy-shorts.jpg",
    "description": "These Navy Blue Shorts are perfect for summer wear. Made from breathable fabric, they keep you cool and comfortable.\n\nThe relaxed fit ensures easy movement, making them ideal for casual outings or workouts.\n\nPair them with a t-shirt or tank top for a laid-back look."
  },
  {
    "id": 15,
    "name": "Grey Zip Hoodie",
    "brand": "Clothique",
    "category": "Hoodies",
    "price": 2699,
    "discount": 12,
    "rating": 4.6,
    "reviews": 102,
    "stock": 55,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Grey"],
    "material": "Cotton Polyester",
    "care": "Cold wash",
    "image": "/products/zip-hoodie.jpg",
    "description": "The Grey Zip Hoodie combines comfort with convenience. The front zipper allows easy wear, while the soft fabric keeps you warm.\n\nIt’s ideal for layering and works well with jeans or joggers.\n\nA reliable everyday essential for casual style."
  },
  {
    "id": 16,
    "name": "White Formal Shirt",
    "brand": "Clothique",
    "category": "Shirts",
    "price": 2399,
    "discount": 10,
    "rating": 4.7,
    "reviews": 140,
    "stock": 70,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["White"],
    "material": "Cotton",
    "care": "Machine wash cold",
    "image": "/products/formal-white.jpg",
    "description": "The White Formal Shirt is a must-have for professional settings. The crisp cotton fabric ensures comfort and a sharp appearance.\n\nIts tailored fit enhances your look, making it suitable for office or formal events.\n\nPair it with trousers or a blazer for a complete outfit."
  },
  {
    "id": 17,
    "name": "Black Jogger Pants",
    "brand": "Clothique",
    "category": "Pants",
    "price": 2199,
    "discount": 8,
    "rating": 4.6,
    "reviews": 88,
    "stock": 65,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Black"],
    "material": "Cotton Blend",
    "care": "Machine wash cold",
    "image": "/products/joggers-black.jpg",
    "description": "Black Jogger Pants offer a perfect mix of comfort and sporty style. The elastic waistband ensures a flexible fit.\n\nIdeal for workouts, travel, or casual wear, these joggers are both practical and stylish.\n\nPair them with hoodies or t-shirts for an effortless look."
  },
  {
    "id": 18,
    "name": "Brown Wool Coat",
    "brand": "Clothique",
    "category": "Coats",
    "price": 9999,
    "discount": 20,
    "rating": 4.8,
    "reviews": 40,
    "stock": 15,
    "sizes": ["M", "L", "XL"],
    "colors": ["Brown"],
    "material": "Wool Blend",
    "care": "Dry clean only",
    "image": "/products/wool-coat.jpg",
    "description": "The Brown Wool Coat provides warmth and elegance. Made from a premium wool blend, it offers insulation without sacrificing style.\n\nPerfect for winter wear, this coat enhances your formal and casual outfits.\n\nA luxurious addition to your wardrobe."
  },
  {
    "id": 19,
    "name": "Printed Summer Shirt",
    "brand": "Clothique",
    "category": "Shirts",
    "price": 1899,
    "discount": 7,
    "rating": 4.5,
    "reviews": 73,
    "stock": 85,
    "sizes": ["S", "M", "L", "XL"],
    "colors": ["Multicolor"],
    "material": "Cotton",
    "care": "Cold wash",
    "image": "/products/printed-shirt.jpg",
    "description": "This Printed Summer Shirt adds color and personality to your outfit. The lightweight cotton fabric keeps you cool.\n\nThe vibrant design is perfect for vacations, beach outings, or casual hangouts.\n\nStyle it with shorts or jeans for a fresh look."
  },
  {
    "id": 20,
    "name": "Beige Chino Pants",
    "brand": "Clothique",
    "category": "Pants",
    "price": 2899,
    "discount": 12,
    "rating": 4.6,
    "reviews": 91,
    "stock": 52,
    "sizes": ["30", "32", "34", "36"],
    "colors": ["Beige"],
    "material": "Cotton",
    "care": "Machine wash cold",
    "image": "/products/chino-beige.jpg",
    "description": "Beige Chino Pants offer a clean and versatile look. The breathable cotton fabric ensures comfort throughout the day.\n\nSuitable for both casual and semi-formal wear, these chinos pair well with shirts or t-shirts.\n\nA stylish and reliable wardrobe essential."
  }
]
